Repository: Dcfgvy/BS-Tournaments-Frontend
Catalog: src/locale/messages.*.xlf
Languages: ru

source: Welcome Back
ru: Войти в аккаунт

source: Don't have an account?
ru: Нет аккаунта?

source: Create today!
ru: Создать аккаунт

source: Brawl Stars Tag
ru: Тег Brawl Stars

source: Password
ru: Пароль

source: Invalid credentials
ru: Некорректные данные

source: Tag is required
ru: Введите тег

source: Tag must be at least 4 characters long.
ru: Тег не менее 4 символов

source: Tag must not exceed 20 characters in length.
ru: Тег не должен превышать 20 символов

source: Password is required
ru: Введите пароль

source: Password must be at least 6 characters long.
ru: Пароль не менее 6 символов

source: Password must not exceed 32 characters in length.
ru: Пароль не должен превышать 32 символа

source: Forgot password?
ru: Забыли пароль?

source: Recover password
ru: Восстановить пароль

source: 1. Sign in via Telegram
ru: 1. Войдите через Telegram

source: If you had your Telegram account connected, then you can try to sign in from our Telegram Mini-App, by <a [href]="'https://t.me/' + botUsername + '?startapp'" target="_blank">clicking here</a>. You should open the Mini-App, using the account you connected. <br><br><b>Hint:</b> Your Telegram account was automatically connected if you registered in the Mini-App, not on the website.
ru: Если к вашему аккаунту был привязан Telegram, вы можете попробовать войти в аккаунт через наш Telegram Mini-App, <a [href]="'https://t.me/' + botUsername + '?startapp'" target="_blank">кликнув здесь</a>. Вы должы открыть Mini-App, используя аккаунт Telegram, которые был привязан к вашей учетной записи. <br><br><b>Обратите внимание:</b> Ваш Telegram был автоматически привязан к аккаунту, если вы регистрировались через мини-приложение, а не через сайт.

source: 2. Update your password
ru: 2. Обновите пароль

source: When signed in the Telegram Mini-App, go to <i>Settings > Update password</i>. There you will be able to choose a new password.
ru: После входа в ваш аккаунт в мини-приложении, перейдите в <i>Настройки > Обновить пароль</i>. Там вы сможете выбрать новый пароль.

source: Sign In
ru: Войти

source: Signed in
ru: Успешный вход

source: Create an account
ru: Создать аккаунт

source: Already have an account?
ru: Уже зарегистрированы?

source: Sign in!
ru: Войти

source: Your Brawl Stars Tag <i (click)="showTagHelpCard = true" class="pi pi-question-circle ml-2 cursor-pointer"></i>
ru: Ваш тег Brawl Stars

source: Brawl Stars Tag
ru: Тег Brawl Stars

source: Why?
ru: Зачем?

source: Your tag is your main authenticator in the system. It is also used to confirm winners in tournaments.
ru: Ваш тег это основной аутентификатор в системе, который используется для входа в аккаунт. Также он нужен для подтверждения победителей в турнирах.

source: Where do I find it?
ru: Где найти?

source: First, click on the profile icon from the main page in Brawl Stars:
ru: Сначала, в Brawl Stars на главной странице кликните на иконку профиля:

source: On your profile page, your tag will be under the player icon:
ru: В профиле тег находится под иконкой игрока

source: Create password
ru: Придумайте пароль

source: Account verification
ru: Верификация аккаунта

source: The trophy change after your last battle is just a simple method to verify that the Brawl Stars account is yours, since nobody else can see that information.
ru: Изменение трофеев – это кол-во кубков, которые вы получили/потеряли в результате последней битвы. Это простой способ подтвердить, что вы владеете указанным аккаунтом Brawl Stars, поскольку никто другой (например, ваши друзья) не могут посмотреть данные ваших боёв.

source: First, open the menu from the main page in Brawl Stars and go to Battle Log:
ru: Сначала в Brawl Stars откройте меню и выберите Данные Боя:

source: In your Battle Log, find the last battle you played (the top one) and notice the trophy change:
ru: На открывшейся странице найдите последнюю, самую верхнюю битву и вы увидите изменение трофеев:

source: Your last battle trophy change: <br><span class="highlight">{{ trophyChangeValue > 0 ? '+' + trophyChangeValue : trophyChangeValue }}</span> <app-trophy/><app-trophy/>
ru: Последнее изменение трофеев: <br><span class="highlight">{{ trophyChangeValue > 0 ? '+' + trophyChangeValue : trophyChangeValue }}</span> <app-trophy/><app-trophy/>

source: Move the slider to select
ru: Двигайте ползунок для выбора

source: A user with this tag already exists.
ru: Пользователь с таким тегом уже существует

source: Invalid data. Double-check the tag and trophy change
ru: Некорректные данные. Перепроверьте тег и изменение трофеев

source: Sign Up
ru: Зарегистрироваться

source: <i class="pi pi-check-circle text-sm mr-1" style="color: green;"></i> Your Telegram account will be automatically connected
ru: <i class="pi pi-check-circle text-sm mr-1" style="color: green;"></i> Ваш аккаунт Telegram будет привязан автоматически

source: Registered successfully!
ru: Успешная регистрация!

source: Access Denied
ru: Доступ запрещён

source: You do not have permission to access this resource.
ru: У вас недостаточно прав для доступа к этим данным

source: Server Error
ru: Ошибка сервера

source: An unknown error occurred. Please try again later.
ru: Произошла неизвестная ошибка. Попробуйте позже.

source: Close
ru: Закрыть
